
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/YamatoKato/st-ecs/actions/runs/11455612095)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-02b5681a4f3c1ab51]
aws_security_group.alb: Refreshing state... [id=sg-0a225dea71e25bef2]
aws_security_group.ecs: Refreshing state... [id=sg-00f732263e7b7cfbb]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-01e1db035ad93125b]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-06652e693df02ece1]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0c4e9191b86bacf1f]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0db9d38d0fa6b6e5e]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0ad00feb61c4acad5]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-085c4da19a9dd999a]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0e4f35268f7682c44]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:485368632596:targetgroup/st-go-web-dev-target-group/76d1e770453f2275]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-00f52ada72fadaee0]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0f011103d12fdb225]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-07e0f7d85c7dcf1cc]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0f343a194803308d3]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-939008187]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-04105bc1ccc282a1c]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-07157bb44b77124e9]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:485368632596:loadbalancer/app/st-go-web-dev-alb/4e29a4c69e8b70f0]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-025e9202f0fa47407]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-026a1d9efb454c7c3]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0ebf2d5ecb1d9d0b0]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0f343a194803308d31080289494]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0402c5a94e6c4dd21]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0649c434aebf2f5d3]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0a9826f32ca19b694]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-07e0f7d85c7dcf1cc1080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0e4f35268f7682c441080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:485368632596:listener/app/st-go-web-dev-alb/4e29a4c69e8b70f0/78a31869aa31e28a]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:485368632596:listener-rule/app/st-go-web-dev-alb/4e29a4c69e8b70f0/78a31869aa31e28a/24e6998cd93abdbd]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.ecr_lifecycle_policy will be created
  + resource "aws_ecr_lifecycle_policy" "ecr_lifecycle_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 30
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "st-go-web-dev"
    }

  # aws_ecr_repository.ecr_repository will be created
  + resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "st-go-web-dev"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
aws_ecr_repository.ecr_repository: Creating...
aws_ecr_repository.ecr_repository: Creation complete after 1s [id=st-go-web-dev]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creating...
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creation complete after 1s [id=st-go-web-dev]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":10,"Program":"tfcmt","SHA1":"eaab35fbd30a0c752421617eadec5593c8273613","Vars":{},"WorkflowName":"Terraform"} -->